/*Од стандарден влез се вчитува n (колку броја треба да има во низата),
а потоа се внесуваат  секој од елементите на низата. 
На излез корисникот треба да отпечати секој елемент кој после него има најмалку два поголеми елементи. 
Пример: 
n=5, niza=[3,10,16,20,1]
корисникот на излез треба да отпечати: 3 10, бидејќи 3 има 3 поголеми вредности, 10 има 2 поголеми вредности,
но не и 16, бидејќи 16 има само една поголема вредност. 
*/

#include <iostream>
using namespace std;
int main() {
 int n;
 cin>>n;
 int niza[n];

 for(int i=0;i<n;i++)
 {
     cin>>niza[i];

 }

for(int i=0;i<n;i++)
{
    int brojac=0;
   for(int j=i;j<n;j++)
   {
       if(niza[i]<niza[j])
           brojac++;
   }
   if(brojac>=2)
       cout<<niza[i]<<" ";

}
    return 0;
}
