/* Од стандарден влез се читаат N броеви.
N не е однапред познато, треба да читате броеви додека да се прочита бројот -1.
Сместете ги прочитаните броеви во низа. 
Во секој тест пример ќе има помалку од 100 броеви пред бројот -1.
Потоа се внесуваат 3 торки од по 4 броеви L, R, V и I. 
L и R се броеви помеѓу 0 и N-1; во секој тест пример ќе важи L < R. 
Бројот I ќе има вредност само 0 или 1. 
Кога I е 0 ќе треба на броевите со индекси во интервалот [L,R] (вклучително на L и R) да додадете вредност V. 
Кога I е 1 ќе треба на броевите со индекси во интервалот (L,R) (не ги вклучува L и R) да додадете вредност V.
На крај отпечатете ја низата.  
*/

#include <iostream>
using namespace  std;
void niza(int a[],int b[],int n){
if(b[3]==0)
{
    for(int i=b[0];i<=b[1];i++)
    {
        a[i]+=b[2];
    }
}
else
{
    for(int i=b[0]+1;i<b[1];i++)
    {
        a[i]+=b[2];
    }
}
}
int main() {
  int n;
  int broevi;
  int a[100];
  do{
      cin>>broevi;
      a[n++]=broevi;
  }while(broevi!=-1);

  n=n-1;

int b[4],c[4],d[4];

for(int i=0;i<4;i++)
{
    cin>>b[i];
}
for(int i=0;i<4;i++)
{
    cin>>c[i];
}
for(int i=0;i<4;i++)
{
    cin>>d[i];
}

    niza(a,b,n);
    niza(a,c,n);
    niza(a,d,n);
    for(int i=0;i<n;i++)
    {
        cout<<a[i]<<" ";
    }
    
    return 0;
}
