/*Од стандарден влез се вчитува матрица сo m редици и n колони. 
Прво се вчитуваат броевите m и n а потоа и елементите на матрицата.
Да се изврши min-max нормализација на секоја колона од матрицата,
односно секој елемент во секоја колона да се замени со вредноста x−minmax−min
каде што x е елемент во некоја колона, а max и min се соодветно најголемиот и
најмалиот елемент во соодветната колона.
Трансформираната матрица да се испечати на екран.
Објаснување на примерот:
Елементите на 0-тата колона се: 1,6,11,16,21. Минимален елемент е 1, а максимален елемент е 21
Секој од 5те елементи ќе се трансформира на следниот начин:
(1-1)/(21-1) = 0/20 = 0.00
(6-1)/(21-1) = 5/20 = 0.25
(11-1)/(21-1) = 10/20 = 0.50
(16-1)/(21-1) = 15/20 = 0.75
(21-1)/(21-1) = 20/20 = 1.00 
*/

#include <iostream>
#include <iomanip>
using namespace  std;

int main() {

    int m,n;
    cin>>m>>n;
    double matrica[m][n];

  for(int i=0;i<m;i++)
  {
      for(int j=0;j<n;j++)
      {
          cin>>matrica[i][j];
      }
  }

  for(int i=0;i<n;i++)
  { float min=1000,max=-1000;
      for(int j=0;j<m;j++)
      {
    if(matrica[j][i]>max)
    {
       max=matrica[j][i];
    }
    if(matrica[j][i]<min)
    {
        min=matrica[j][i];
    }
      }
      for(int j=0;j<m;j++)
      {
          matrica[j][i]=(matrica[j][i]-min)/(max-min);
      }

  }
    for(int i=0;i<m;i++)
    {
        for(int j=0;j<n;j++)
        {
            cout<<fixed<<setprecision(2)<<matrica[i][j]<<" ";
        }
        cout<<endl;
    }
    return 0;
}
