/*Од стандарден влез се чита број n, а потоа се читаат и n броеви.
Потребно е на екран да се испечатат сите броеви кои што се строго растечки односо секоја цифра е 
поголема од претходната (1589 е растечки, 1529 не е растечки).
Проверката за тоа дали бројот е растечки да се реализира со посебна функција која ќе врати 1 ако е растечки
и -1 ако не е растечки. Дополнително ако бројот е растечки за него треба да се повика функција која ќе ја 
пресмета сумата на цифрите од кои е составен.
Дополнително: функцијата за пресметување на сума на цифри да биде рекурзивна
Печатењето треба да е во следен формат: 1234 (suma:  10) 
*/

#include <iostream>
using namespace  std;
bool rastecki(int n){
    int brojac1=0;
    int brojac2=0;
    while(n/10%10!=0) {
        if (n % 10 > (n / 10)% 10) {
            brojac1++;
        }
        brojac2++;
        n/=10;
    }
    if(brojac1==brojac2)
        return true;
    return  false;
}
void sum(int n,int &suma){
    if(n==0)
    {
        return;
    }
    suma+=n%10;
    return sum(n/10,suma);
}
int main() {
    int n;
    cin>>n;
    int niza[n];
    for(int i=0;i<n;i++)
    {
        cin>>niza[i];
    }
    for(int i=0;i<n;i++)
    {
        if(rastecki(niza[i]))
        {
            int suma=0;
            sum(niza[i],suma);
            cout<<niza[i]<<" (suma: "<<suma<<")"<<endl;
        }
    }
}
