/*Сакаме да ги истражиме цените на одредени производи во продавница и да видиме кои од нив се над просечната цена,
а кои се под просечната цена. 
За да го постигнеме ова, влезот е 
N, бројот на производите, и потоа 
N производи, претставувајќи ја нивната цена. Вашата задача е да го пресметате просекот на сите производи,
а потоа да ги замените оние кои се под просекот со вредност 0 и оние над просекот (или еднакви) со вредност 1.
На излез испечатете ја просечната цена, како и трансформираната низата (види тест примери) 
*/

#include <iostream>
using namespace std;
int main() {
 int n;
 cin>>n;
 int niza[n];
 float prosek=0;
 for(int i=0;i<n;i++)
 {
     cin>>niza[i];
     prosek+=niza[i];
 }
 prosek=prosek/n;
 for(int i=0;i<n;i++)
 {
     if(niza[i]>=prosek)
     {
         niza[i]=1;
     }
     else
         niza[i]=0;
 }
 cout<<"Average price: "<<prosek<<endl;
    for(int i=0;i<n;i++)
    {
       cout<<niza[i]<<" ";
    }
    return 0;
}
