//Од тастатура се читаат непознат број на позитивни цели броеви (со максимум 5 цифри) се додека не се
//внесе нешто различно од број.
//За секој број треба да се најде позицијата (од десно на лево) на првото појавување на најголемата цифра во
//составот на бројот (цифрата на единици се наоѓа на позиција 0). 
//Потоа, да се испечати статистика за позициите на најдените цифри со максимална вредност во следниот формат:
//[позиција]: [вкупно броеви чија максимална цифра се наоѓа на таа позиција]
//0: 2
//1: 3
//2: 1
//3: 1
//4: 1
//за броевите 97654 48654 12345 12343 1263 12443 12643 12777

#include <iostream>
using namespace std;

int main() {
    int broj,broj1=0,max=0,pozicija=0;
    int b0=0,b1=0,b2=0,b3=0,b4=0;
 while(1) {
        cin >> broj;
if(!broj)break;
        for (int i = 0; i < 5; i++) {
            broj1 = broj % 10;
            if (broj1 > max) {
                max = broj1;
                pozicija = i;
            }
            broj/=10;
        }
        max=0;
        if(pozicija==0)
        {
            b0++;
        }
        else if(pozicija==1)
        {
            b1++;
        }
       else if(pozicija==2)
        {
            b2++;
        }
        else if(pozicija==3)
        {
            b3++;
        } else if(pozicija==4)
        {
            b4++;

        }
        pozicija=0;
        broj1=0;
    };
    cout<<"0: "<<b0<<endl;
    cout<<"1: "<<b1<<endl;
    cout<<"2: "<<b2<<endl;
    cout<<"3: "<<b3<<endl;
    cout<<"4: "<<b4<<endl;

    return 0;
}
