//Од тастатура се читаат 2 позитивни цели броеви. 
//Доколку се внесе барем еден негативен број или 0 треба да се печати „Invalid input“.
//Треба да се определи дали помалиот број “е парен еквивалент” од поголемиот број.
//Еден број “е парен еквивалент” на друг број, 
//ако и само ако неговите цифри се наоѓаат на парните позиции од другиот број, во истиот редослед. 
//Соодветно да се испечатат пораки „PAREN“ и „NE“.
//Позициите треба да се сметаат оддесно-налево (најмалку значајната цифра е на позиција 1)

#include <iostream>
using namespace  std;
int main(){
    int a,b;

    cin>>a>>b;
    int s1=0,s2=0;
    if(a<=0||b<=0)
    {
        cout<<"Invalid input";
        return 0;
    }
    else
    {
        int tmp;
        if(a<b) {
            tmp = a;
            a = b;
            b = tmp;
        }
        int a1,b1;
        while(b!=0)
        {
            b1=b%10;
            a1=a/10%10;
            if(a1==b1)
            {
                s2++;
            }
            a/=100;
            b/=10;
            s1++;
        }     
        if(s1==s2)
        {
            cout<<"PAREN";
        }
        else
        {
            cout<<"NE";
        }
    }
    return 0;
}
