//Од стандарден влез се внесуваат два цели броја N и Х.
//Да се најде најблискот број помал од N коj е тотално различен од бројот Х.
//Еден број е тотално различен од друг ако и само ако во него не се појавува ниту една од цифрите на другиот број.
//Задачата да се реши без употреба на низи и матрици.

#include <iostream>
#include <string>
using namespace std;
int main(){
    int n,x;
    cin>>n>>x;
    n--;
    for(n;n>0;n--)
    {
        int isti=0;
        for(int tn=n;tn!=0;tn/=10)
        {
            for(int tx=x;tx!=0;tx/=10)
            {
                if(tn%10==tx%10)
                {
                    isti=1;
                }
            }
        }
        if(!isti) break;
    }
    cout<<n;

    return 0;
}
