//Од тастатура се читаат непознат број позитивни цели броеви се додека не се внесе нешто различно од број.
//За секој број треба да се пресмета збирот на цифрата со максимална вредност од претходно внесениот број 
//и сумата на цифрите на тековниот број (за првиот внесен број се пресметува само сумата на неговите цифри). 
//За секој внесен број резултатот треба да се испечати во следниот формат:
//[број]: [сумата на цифрите на бројот + максималната цифра од претходниот број]
//342: 9   //3+4+2
//345: 16 //3+4+5+4
//123: 11 //1+2+3+5
//456: 18 //4+5+6+3

#include <iostream>
using namespace std;

int main() {
    int broj,prethoden_max=0,zbir=0,max=0;
 while(1) {
        cin >> broj;
if(!broj)break;
  int temp;
  int broj1=broj;
  while(broj!=0)
  {
      temp=broj%10;
      zbir+=temp;
      if(temp>max)
      {
          max=temp;
      }
      broj/=10;

  }
  zbir+=prethoden_max;
  cout<<broj1<<": "<<zbir<<endl;
     prethoden_max=max;
     zbir=0;
  max=0;
    }
    return 0;
}
