/* Да се напише програма во која се вчитува матрица од цели броеви A со N редици и N * 2 колони (N не е поголемо од 50). 
Програмата треба да ја трансформира вчитаната матрица во нова матрица B, 
така што сите елементи десно од N-тата колона ќе ги префрли под N-тата редица,
односно од матрица со димензија N редици и 2 * N колони ќе се добие матрица со 2 * N редици x N колони. */

#include <iostream>
using namespace std;

int main() {
    int n;
    cin >> n;
    int A[n][n*2];
    for (int i = 0; i < n; i++) {
        for (int j = 0; j < n*2; j++) {
            cin >> A[i][j];
        }
    }
    int B[n*2][n];
    for(int i=0;i<n;i++)
    {
        for(int j=0;j<n;j++)
        {
            B[i][j]=A[i][j];
            B[i+n][j]=A[i][j+n];
        }
    }


    //pecati ja B[i][j]
    for(int i=0;i<n*2;i++)
    {
        for(int j=0;j<n;j++)
        {
            cout<<B[i][j]<<" ";
        }
        cout<<endl;
    }

    return 0;
}
