/* Да се имплементира рекурзивна функција која за низа од цели броеви $[a{0}, a{1}, ..., a_{n-1}]$ 
  ќе ја пресмета вредноста на непрекинатата дропка дефинирана како:
v=a0+1a1+...1an−2+1an−1

Да се напише програма во која се чита цел број N, 
  по што се читаат елементите на низа од N цели броеви (не повеќе од 100).
  Потоа се повикува рекурзивната функција и се печати резултатот во нов ред. */

#include <iostream>
using namespace  std;
float v(int niza[],int n,int i){
    if(n-1==i)
        return niza[i];
    return niza[i]+1.00/v(niza,n,i+1);
}
int main(){
    int n;
cin>>n;
    int niza[n];

    for(int i=0;i<n;i++){
        cin>>niza[i];
    }
    cout<<v(niza,n,0);
    return 0;
}
