/* Да се напише рекурзивна функција за наоѓање на максималната цифра од даден цел број.
Од стандарден влез се внесуваат непознат број цели броеви се додека не се внесе нешто што не е број. 
За секој од нив да се испечати максималната цифра во посебен ред.
Забелешка: Решението со рекурзивна функција носи 100% од поените, а со нерекурзивна функција 70% од поените.
Забелешка: ЗАБРАНЕТО е користење на глобални променливи. */

#include <iostream>
using  namespace  std;
int maks(int a,int &max) {
   if(a==0) {
       return 0;
   }
   if(a%10>max)
   {
       max=a%10;
   }
   return maks(a/10,max);
}

int main(){

    int n;
    while(cin>>n) {
        int max=0;
        maks(n, max);
        cout << max<<endl;
    }
    return 0;
}
